In [122]:
# Import Libraries 
import pandas as pd 
import numpy as np 
import seaborn as sns 
import matplotlib.pyplot as plt

# Import Dataset

In [123]:
data=pd.read_csv(r"C:\Users\ASUS\Downloads\Titanic-Dataset.csv",usecols=['Pclass','Ticket'])
data.head()

   Pclass            Ticket
0       3         A/5 21171
1       1          PC 17599
2       3  STON/O2. 3101282
3       1            113803
4       3            373450

In [124]:
# To make the desired data i make changes in this stocks data and make one toy data 
df=pd.DataFrame(data["Pclass"].replace(3,'Third'),columns=["Pclass"])

In [125]:
df.sample(7)

    Pclass
693  Third
365  Third
177      1
550      1
185      1
328  Third
832  Third

# Now we are practicing with the dataset in which one of the column have numerical and categorical in each cells .

In [126]:
df.head()

  Pclass
0  Third
1      1
2  Third
3      1
4  Third

In [127]:
df["Pclass"].unique()

array(['Third', 1, 2], dtype=object)

In [128]:
# Extract all of the numerical values of Pclass in the column name which is Pclass_int 
df["Pclass_int"]=pd.to_numeric(df["Pclass"],errors='coerce')

In [129]:
df.head()

  Pclass  Pclass_int
0  Third         NaN
1      1         1.0
2  Third         NaN
3      1         1.0
4  Third         NaN

# Now we have to extract the the string wala part

In [130]:
# So for this we use the code which is this 
df["Pclass_cat"]=np.where(df["Pclass_int"].isnull(),df["Pclass"],np.nan)

In [131]:
df.head()

  Pclass  Pclass_int Pclass_cat
0  Third         NaN      Third
1      1         1.0        NaN
2  Third         NaN      Third
3      1         1.0        NaN
4  Third         NaN      Third

# Now fill these null values which are formed in the new columns in numerical fill with 0 and in category fill with Missing

In [132]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Pclass      891 non-null    object
 1   Pclass_int  400 non-null    float64
 2   Pclass_cat  491 non-null    object
dtypes: float64(1), object(2)
memory usage: 21.0+ KB

In [133]:
df["Pclass_int"]=df["Pclass_int"].fillna(0)

In [134]:
df["Pclass_cat"]=df["Pclass_cat"].fillna("Missing")

In [135]:
df.head(10)

  Pclass  Pclass_int Pclass_cat
0  Third         0.0      Third
1      1         1.0    Missing
2  Third         0.0      Third
3      1         1.0    Missing
4  Third         0.0      Third
5  Third         0.0      Third
6      1         1.0    Missing
7  Third         0.0      Third
8  Third         0.0      Third
9      2         2.0    Missing

In [136]:
df=df.drop(columns=["Pclass"],axis=1)

In [137]:
df.sample(10)

     Pclass_int Pclass_cat
737         1.0    Missing
412         1.0    Missing
298         1.0    Missing
744         0.0      Third
623         0.0      Third
829         1.0    Missing
493         1.0    Missing
71          0.0      Third
423         0.0      Third
716         1.0    Missing

In [141]:
# Now we have to work on the column which have both numerical and categorical in a simgle cell of the column 
df1=pd.DataFrame(data["Ticket"])

In [144]:
df1.head(15) '''Now you can look that in this dataset their is one oattern that after the categorical value their is the gap and after that 
numerical value '''

              Ticket
0          A/5 21171
1           PC 17599
2   STON/O2. 3101282
3             113803
4             373450
5             330877
6              17463
7             349909
8             347742
9             237736
10           PP 9549
11            113783
12         A/5. 2151
13            347082
14            350406

In [151]:
# Now in This we have to split this data into numerical in one column and categerical type of data in another column 
df1["Ticket_numerical"]=df1["Ticket"].str.extract('(\d+)$')

In [155]:
df1["Ticket_categorical"] = df1["Ticket"].str.extract(r'^(.+?)\s+\d+$')

df1["Ticket_categorical"]

0           A/5
1            PC
2      STON/O2.
3           NaN
4           NaN
         ...
886         NaN
887         NaN
888       W./C.
889         NaN
890         NaN
Name: Ticket_categorical, Length: 891, dtype: object

In [156]:
df1

               Ticket Ticket_categorical Ticket_numerical
0           A/5 21171                A/5            21171
1            PC 17599                 PC            17599
2    STON/O2. 3101282           STON/O2.          3101282
3              113803                NaN           113803
4              373450                NaN           373450
..                ...                ...              ...
886            211536                NaN           211536
887            112053                NaN           112053
888        W./C. 6607              W./C.             6607
889            111369                NaN           111369
890            370376                NaN           370376

[891 rows x 3 columns]

In [157]:
# Now can also fill the null values with missing in categorical and 0 in Numerical 
df1["Ticket_categorical"]=df1["Ticket_categorical"].fillna('Missing')

In [158]:
# Now can also fill the null values with missing in categorical and 0 in Numerical 
df1["Ticket_numerical"]=df1["Ticket_numerical"].fillna('0')

In [159]:
df1

               Ticket Ticket_categorical Ticket_numerical
0           A/5 21171                A/5            21171
1            PC 17599                 PC            17599
2    STON/O2. 3101282           STON/O2.          3101282
3              113803            Missing           113803
4              373450            Missing           373450
..                ...                ...              ...
886            211536            Missing           211536
887            112053            Missing           112053
888        W./C. 6607              W./C.             6607
889            111369            Missing           111369
890            370376            Missing           370376

[891 rows x 3 columns]

In [160]:
df1["Ticket_categorical"].unique() 
# So their are less categories now you can apply Odinal encoding and perfornm this in your machine learning

array(['A/5', 'PC', 'STON/O2.', 'Missing', 'PP', 'A/5.', 'C.A.', 'A./5.',
       'SC/Paris', 'S.C./A.4.', 'A/4.', 'CA', 'S.P.', 'S.O.C.', 'SO/C',
       'W./C.', 'SOTON/OQ', 'W.E.P.', 'STON/O 2.', 'A4.', 'C',
       'SOTON/O.Q.', 'SC/PARIS', 'S.O.P.', 'A.5.', 'Fa', 'CA.', 'F.C.C.',
       'W/C', 'SW/PP', 'SCO/W', 'P/PP', 'SC', 'SC/AH', 'A/S',
       'SC/AH Basle', 'A/4', 'WE/P', 'S.W./PP', 'S.O./P.P.', 'F.C.',
       'SOTON/O2', 'S.C./PARIS', 'C.A./SOTON'], dtype=object)

In [161]:
df1["Ticket"].unique() # Before Spliting this ..

array(['A/5 21171', 'PC 17599', 'STON/O2. 3101282', '113803', '373450',
       '330877', '17463', '349909', '347742', '237736', 'PP 9549',
       '113783', 'A/5. 2151', '347082', '350406', '248706', '382652',
       '244373', '345763', '2649', '239865', '248698', '330923', '113788',
       '347077', '2631', '19950', '330959', '349216', 'PC 17601',
       'PC 17569', '335677', 'C.A. 24579', 'PC 17604', '113789', '2677',
       'A./5. 2152', '345764', '2651', '7546', '11668', '349253',
       'SC/Paris 2123', '330958', 'S.C./A.4. 23567', '370371', '14311',
       '2662', '349237', '3101295', 'A/4. 39886', 'PC 17572', '2926',
       '113509', '19947', 'C.A. 31026', '2697', 'C.A. 34651', 'CA 2144',
       '2669', '113572', '36973', '347088', 'PC 17605', '2661',
       'C.A. 29395', 'S.P. 3464', '3101281', '315151', 'C.A. 33111',
       'S.O.C. 14879', '2680', '1601', '348123', '349208', '374746',
       '248738', '364516', '345767', '345779', '330932', '113059',
       'SO/C 14885', '3101278', 'W./C. 6608', 'SOTON/OQ 392086', '343275',
       '343276', '347466', 'W.E.P. 5734', 'C.A. 2315', '364500', '374910',
       'PC 17754', 'PC 17759', '231919', '244367', '349245', '349215',
       '35281', '7540', '3101276', '349207', '343120', '312991', '349249',
       '371110', '110465', '2665', '324669', '4136', '2627',
       'STON/O 2. 3101294', '370369', 'PC 17558', 'A4. 54510', '27267',
       '370372', 'C 17369', '2668', '347061', '349241',
       'SOTON/O.Q. 3101307', 'A/5. 3337', '228414', 'C.A. 29178',
       'SC/PARIS 2133', '11752', '7534', 'PC 17593', '2678', '347081',
       'STON/O2. 3101279', '365222', '231945', 'C.A. 33112', '350043',
       '230080', '244310', 'S.O.P. 1166', '113776', 'A.5. 11206',
       'A/5. 851', 'Fa 265302', 'PC 17597', '35851', 'SOTON/OQ 392090',
       '315037', 'CA. 2343', '371362', 'C.A. 33595', '347068', '315093',
       '363291', '113505', 'PC 17318', '111240', 'STON/O 2. 3101280',
       '17764', '350404', '4133', 'PC 17595', '250653', 'LINE',
       'SC/PARIS 2131', '230136', '315153', '113767', '370365', '111428',
       '364849', '349247', '234604', '28424', '350046', 'PC 17610',
       '368703', '4579', '370370', '248747', '345770', '3101264', '2628',
       'A/5 3540', '347054', '2699', '367231', '112277',
       'SOTON/O.Q. 3101311', 'F.C.C. 13528', 'A/5 21174', '250646',
       '367229', '35273', 'STON/O2. 3101283', '243847', '11813',
       'W/C 14208', 'SOTON/OQ 392089', '220367', '21440', '349234',
       '19943', 'PP 4348', 'SW/PP 751', 'A/5 21173', '236171', '347067',
       '237442', 'C.A. 29566', 'W./C. 6609', '26707', 'C.A. 31921',
       '28665', 'SCO/W 1585', '367230', 'W./C. 14263',
       'STON/O 2. 3101275', '2694', '19928', '347071', '250649', '11751',
       '244252', '362316', '113514', 'A/5. 3336', '370129', '2650',
       'PC 17585', '110152', 'PC 17755', '230433', '384461', '110413',
       '112059', '382649', 'C.A. 17248', '347083', 'PC 17582', 'PC 17760',
       '113798', '250644', 'PC 17596', '370375', '13502', '347073',
       '239853', 'C.A. 2673', '336439', '347464', '345778', 'A/5. 10482',
       '113056', '349239', '345774', '349206', '237798', '370373',
       '19877', '11967', 'SC/Paris 2163', '349236', '349233', 'PC 17612',
       '2693', '113781', '19988', '9234', '367226', '226593', 'A/5 2466',
       '17421', 'PC 17758', 'P/PP 3381', 'PC 17485', '11767', 'PC 17608',
       '250651', '349243', 'F.C.C. 13529', '347470', '29011', '36928',
       '16966', 'A/5 21172', '349219', '234818', '345364', '28551',
       '111361', '113043', 'PC 17611', '349225', '7598', '113784',
       '248740', '244361', '229236', '248733', '31418', '386525',
       'C.A. 37671', '315088', '7267', '113510', '2695', '2647', '345783',
       '237671', '330931', '330980', 'SC/PARIS 2167', '2691',
       'SOTON/O.Q. 3101310', 'C 7076', '110813', '2626', '14313',
       'PC 17477', '11765', '3101267', '323951', 'C 7077', '113503',
       '2648', '347069', 'PC 17757', '2653', 'STON/O 2. 3101293',
       '349227', '27849', '367655', 'SC 1748', '113760', '350034',
       '3101277', '350052', '350407', '28403', '244278', '240929',
       'STON/O 2. 3101289', '341826', '4137', '315096', '28664', '347064',
       '29106', '312992', '349222', '394140', 'STON/O 2. 3101269',
       '343095', '28220', '250652', '28228', '345773', '349254',
       'A/5. 13032', '315082', '347080', 'A/4. 34244', '2003', '250655',
       '364851', 'SOTON/O.Q. 392078', '110564', '376564', 'SC/AH 3085',
       'STON/O 2. 3101274', '13507', 'C.A. 18723', '345769', '347076',
       '230434', '65306', '33638', '113794', '2666', '113786', '65303',
       '113051', '17453', 'A/5 2817', '349240', '13509', '17464',
       'F.C.C. 13531', '371060', '19952', '364506', '111320', '234360',
       'A/S 2816', 'SOTON/O.Q. 3101306', '113792', '36209', '323592',
       '315089', 'SC/AH Basle 541', '7553', '31027', '3460', '350060',
       '3101298', '239854', 'A/5 3594', '4134', '11771', 'A.5. 18509',
       '65304', 'SOTON/OQ 3101317', '113787', 'PC 17609', 'A/4 45380',
       '36947', 'C.A. 6212', '350035', '315086', '364846', '330909',
       '4135', '26360', '111427', 'C 4001', '382651', 'SOTON/OQ 3101316',
       'PC 17473', 'PC 17603', '349209', '36967', 'C.A. 34260', '226875',
       '349242', '12749', '349252', '2624', '2700', '367232',
       'W./C. 14258', 'PC 17483', '3101296', '29104', '2641', '2690',
       '315084', '113050', 'PC 17761', '364498', '13568', 'WE/P 5735',
       '2908', '693', 'SC/PARIS 2146', '244358', '330979', '2620',
       '347085', '113807', '11755', '345572', '372622', '349251',
       '218629', 'SOTON/OQ 392082', 'SOTON/O.Q. 392087', 'A/4 48871',
       '349205', '2686', '350417', 'S.W./PP 752', '11769', 'PC 17474',
       '14312', 'A/4. 20589', '358585', '243880', '2689',
       'STON/O 2. 3101286', '237789', '13049', '3411', '237565', '13567',
       '14973', 'A./5. 3235', 'STON/O 2. 3101273', 'A/5 3902', '364848',
       'SC/AH 29037', '248727', '2664', '349214', '113796', '364511',
       '111426', '349910', '349246', '113804', 'SOTON/O.Q. 3101305',
       '370377', '364512', '220845', '31028', '2659', '11753', '350029',
       '54636', '36963', '219533', '349224', '334912', '27042', '347743',
       '13214', '112052', '237668', 'STON/O 2. 3101292', '350050',
       '349231', '13213', 'S.O./P.P. 751', 'CA. 2314', '349221', '8475',
       '330919', '365226', '349223', '29751', '2623', '5727', '349210',
       'STON/O 2. 3101285', '234686', '312993', 'A/5 3536', '19996',
       '29750', 'F.C. 12750', 'C.A. 24580', '244270', '239856', '349912',
       '342826', '4138', '330935', '6563', '349228', '350036', '24160',
       '17474', '349256', '2672', '113800', '248731', '363592', '35852',
       '348121', 'PC 17475', '36864', '350025', '223596', 'PC 17476',
       'PC 17482', '113028', '7545', '250647', '348124', '34218', '36568',
       '347062', '350048', '12233', '250643', '113806', '315094', '36866',
       '236853', 'STON/O2. 3101271', '239855', '28425', '233639',
       '349201', '349218', '16988', '376566', 'STON/O 2. 3101288',
       '250648', '113773', '335097', '29103', '392096', '345780',
       '349204', '350042', '29108', '363294', 'SOTON/O2 3101272', '2663',
       '347074', '112379', '364850', '8471', '345781', '350047',
       'S.O./P.P. 3', '2674', '29105', '347078', '383121', '36865',
       '2687', '113501', 'W./C. 6607', 'SOTON/O.Q. 3101312', '374887',
       '3101265', '12460', 'PC 17600', '349203', '28213', '17465',
       '349244', '2685', '2625', '347089', '347063', '112050', '347087',
       '248723', '3474', '28206', '364499', '112058', 'STON/O2. 3101290',
       'S.C./PARIS 2079', 'C 7075', '315098', '19972', '368323', '367228',
       '2671', '347468', '2223', 'PC 17756', '315097', '392092', '11774',
       'SOTON/O2 3101287', '2683', '315090', 'C.A. 5547', '349213',
       '347060', 'PC 17592', '392091', '113055', '2629', '350026',
       '28134', '17466', '233866', '236852', 'SC/PARIS 2149', 'PC 17590',
       '345777', '349248', '695', '345765', '2667', '349212', '349217',
       '349257', '7552', 'C.A./SOTON 34068', 'SOTON/OQ 392076', '211536',
       '112053', '111369', '370376'], dtype=object)